JBHarvey/design-iii/src/stm32/dev/src/main.c
		 }*/
		/* Clear interrupt flag */
		EXTI_ClearITPendingBit (EXTI_Line10);
	}

	if (EXTI_GetITStatus(EXTI_Line11) != RESET) {
		/* increase ticks */
		numberOfSpeedEdges3++;

		wheel3Channel1UP = GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_10);
		wheel3Channel2UP = GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_11);

		// check wheel 3
		if (wheel3Channel1UP == wheel3Channel2UP) {
			numberOfPositionEdges3++;
			incWheel3Canal2EncoderCounter++;
			speedDirection3 = SPEED_DIRECTION_FORWARD;
		} else {
			numberOfPositionEdges3--;
			decWheel3Canal2EncoderCounter++;
			speedDirection3 = SPEED_DIRECTION_BACKWARD;
		}

		/*if (speedDirection3 == SPEED_DIRECTION_FORWARD) {
		 numberOfPositionEdges3++;
		 incWheel3Canal2EncoderCounter++;
		 }

		 else if (speedDirection3 == SPEED_DIRECTION_BACKWARD) {
		 numberOfPositionEdges3--;
		 decWheel3Canal2EncoderCounter++;
		 }*/
		/* Clear interrupt flag */
		EXTI_ClearITPendingBit (EXTI_Line11);
	}

	if (EXTI_GetITStatus(EXTI_Line12) != RESET) {
		/* increase ticks */
		numberOfSpeedEdges4++;

		wheel4Channel1UP = GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_12);
		wheel4Channel2UP = GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_13);

		// check wheel 4
		if (wheel4Channel1UP != wheel4Channel2UP) {
			numberOfPositionEdges4++;
			incWheel4Canal1EncoderCounter++;
			speedDirection4 = SPEED_DIRECTION_FORWARD;
		} else {
			numberOfPositionEdges4--;
			decWheel4Canal1EncoderCounter++;
			speedDirection4 = SPEED_DIRECTION_BACKWARD;
		}

		/*if (speedDirection4 == SPEED_DIRECTION_FORWARD) {
		 numberOfPositionEdges4++;
		 incWheel4Canal1EncoderCounter++;
		 } else if (speedDirection4 == SPEED_DIRECTION_BACKWARD) {
		 numberOfPositionEdges4--;
		 decWheel4Canal1EncoderCounter++;
		 }*/
		/* Clear interrupt flag */
		EXTI_ClearITPendingBit (EXTI_Line12);
	}

	if (EXTI_GetITStatus(EXTI_Line13) != RESET) {
		/* increase ticks */
		numberOfSpeedEdges4++;

		wheel4Channel1UP = GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_12);
		wheel4Channel2UP = GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_13);

		// check wheel 4
		if (wheel4Channel1UP == wheel4Channel2UP) {
			numberOfPositionEdges4++;
			incWheel4Canal2EncoderCounter++;
			speedDirection4 = SPEED_DIRECTION_FORWARD;
		} else {
			numberOfPositionEdges4--;
			decWheel4Canal2EncoderCounter++;
			speedDirection4 = SPEED_DIRECTION_BACKWARD;
		}

		/*if (speedDirection4 == SPEED_DIRECTION_FORWARD) {
		 numberOfPositionEdges4++;
		 incWheel4Canal2EncoderCounter++;
		 } else if (speedDirection4 == SPEED_DIRECTION_BACKWARD) {
		 numberOfPositionEdges4--;
		 decWheel4Canal2EncoderCounter++;
		 }*/
		/* Clear interrupt flag */
		EXTI_ClearITPendingBit (EXTI_Line13);
	}
}

extern void TIM2_IRQHandler() {
	if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET) {
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);

		/* update Speed pids */
		if (speedDirection1 == SPEED_DIRECTION_FORWARD) {
			PID_SPEED1.myInput = numberOfSpeedEdges1;
		} else if (speedDirection1 == SPEED_DIRECTION_BACKWARD) {
			PID_SPEED1.myInput = -numberOfSpeedEdges1;
		}
		if (speedDirection2 == SPEED_DIRECTION_FORWARD) {
			PID_SPEED2.myInput = numberOfSpeedEdges2;
		} else if (speedDirection2 == SPEED_DIRECTION_BACKWARD) {
			PID_SPEED2.myInput = -numberOfSpeedEdges2;
		}
		if (speedDirection3 == SPEED_DIRECTION_FORWARD) {
			PID_SPEED3.myInput = numberOfSpeedEdges3; // slave
		} else if (speedDirection3 == SPEED_DIRECTION_BACKWARD) {
			PID_SPEED3.myInput = -numberOfSpeedEdges3; // slave

		}
		if (speedDirection4 == SPEED_DIRECTION_FORWARD) {
			PID_SPEED4.myInput = numberOfSpeedEdges4; // slave
		} else if (speedDirection4 == SPEED_DIRECTION_BACKWARD) {
			PID_SPEED4.myInput = -numberOfSpeedEdges4; // slave
		}

		ticksBuffer4[ticksIndex4] = numberOfSpeedEdges2;
		ticksIndex4++;
		if (ticksIndex4 >= TICKS_BUFFER_SIZE) {
			ticksIndex4 = 0;
		}
		/* update position pids */
		PID_POSITION1.myInput = numberOfPositionEdges1;
		PID_POSITION2.myInput = numberOfPositionEdges2;
		PID_POSITION3.myInput = numberOfPositionEdges3;
		PID_POSITION4.myInput = numberOfPositionEdges4;

		/* activate speed pids */
		PID_SetMode(&PID_SPEED1, PID_Mode_Automatic);
		PID_SetMode(&PID_SPEED2, PID_Mode_Automatic);
		PID_SetMode(&PID_SPEED3, PID_Mode_Automatic);
		PID_SetMode(&PID_SPEED4, PID_Mode_Automatic);

		/* activate position pids */
		PID_SetMode(&PID_POSITION1, PID_Mode_Automatic);
		PID_SetMode(&PID_POSITION2, PID_Mode_Automatic);
		PID_SetMode(&PID_POSITION3, PID_Mode_Automatic);
		PID_SetMode(&PID_POSITION4, PID_Mode_Automatic);

		numberOfSpeedEdges1 = 0;
		numberOfSpeedEdges2 = 0;
		numberOfSpeedEdges3 = 0;
		numberOfSpeedEdges4 = 0;

		/* reset position for each wheels */
		/*if (-0.01 < PID_POSITION1.mySetpoint - PID_POSITION1.myInput
		 && PID_POSITION1.mySetpoint - PID_POSITION1.myInput < 0.01) {
		 numberOfPositionEdges1 = 0;
		 PID_POSITION1.mySetpoint = 0;
		 PID_POSITION1.myInput = 0;
		 }

		 if (-0.01 < PID_POSITION2.mySetpoint - PID_POSITION2.myInput
		 && PID_POSITION2.mySetpoint - PID_POSITION2.myInput < 0.01) {
		 numberOfPositionEdges2 = 0;
		 PID_POSITION2.mySetpoint = 0;
		 PID_POSITION2.myInput = 0;
		 }

		 if (-0.01 < PID_POSITION3.mySetpoint - PID_POSITION3.myInput
		 && PID_POSITION3.mySetpoint - PID_POSITION3.myInput < 0.01) {
		 numberOfPositionEdges3 = 0;
		 PID_POSITION3.mySetpoint = 0;
		 PID_POSITION3.myInput = 0;
		 }

		 if (-0.01 < PID_POSITION4.mySetpoint - PID_POSITION4.myInput
		 && PID_POSITION4.mySetpoint - PID_POSITION4.myInput < 0.01) {
		 numberOfPositionEdges4 = 0;
		 PID_POSITION4.mySetpoint = 0;
		 PID_POSITION4.myInput = 0;
		 }*/
	}
}
/*
 void setPIDCoeficient(float xMove, float yMove) {
 float xMoveAbsolute;
 float yMoveAbsolute;

 if (xMove >= 0) {
 xMoveAbsolute = xMove;
 } else {
 xMoveAbsolute = -xMove;
 }

 if (yMove >= 0) {
 yMoveAbsolute = yMove;
 } else {
 yMoveAbsolute = -yMove;
 }

 float max;
 float min;
 uint8_t xAxisMax;

 if (xMoveAbsolute >= yMoveAbsolute) {
 xAxisMax = 1;
 max = xMoveAbsolute;
 min = yMoveAbsolute;
 } else {
 xAxisMax = 0;
 max = yMoveAbsolute;
 min = xMoveAbsolute;
 }


 float coef = 1 - ((max - min) / max);

