JBHarvey/design-iii/src/stm32/dev/src/main.c
 if (xAxisMax == 1) {
 PID_POSITION1.coef = coef;
 PID_POSITION3.coef = coef;
 PID_POSITION2.coef = 1;
 PID_POSITION4.coef = 1;
 } else {
 PID_POSITION1.coef = 1;
 PID_POSITION3.coef = 1;
 PID_POSITION2.coef = coef;
 PID_POSITION4.coef = coef;
 }
 }*/

/* callback when data arrives on USB */
extern void handle_full_packet(uint8_t type, uint8_t *data, uint8_t len) {
	switch (type) {
	case COMMAND_MOVE:
		if (len == 8 && type == COMMAND_MOVE) {
			/* send data to test send feature on Usb */
			//uint8_t dataToSend[10] = { 1, 8, 3, 4, 5, 6, 7, 8, 9, 10 };
			//TM_USB_VCP_Send(dataToSend, 10);
			/* get X Y distances */
			float xMove = getXMoveFromBuffer(data);
			float yMove = getYMoveFromBuffer(data);

			/*setPIDCoeficient(xMove, yMove);*/

			PID_POSITION1.mySetpoint = xMove;
			PID_POSITION3.mySetpoint = xMove;
			PID_POSITION2.mySetpoint = yMove;
			PID_POSITION4.mySetpoint = yMove;

			numberOfPositionEdges1 = 0;
			numberOfPositionEdges2 = 0;
			numberOfPositionEdges3 = 0;
			numberOfPositionEdges4 = 0;

			PID_POSITION1.ITerm = 0;
			PID_SPEED1.ITerm = 0;
			PID_POSITION2.ITerm = 0;
			PID_SPEED2.ITerm = 0;
			PID_POSITION3.ITerm = 0;
			PID_SPEED3.ITerm = 0;
			PID_POSITION4.ITerm = 0;
			PID_SPEED4.ITerm = 0;

			PID_POSITION1.lastInput = 0;
			PID_SPEED1.lastInput = 0;
			PID_POSITION2.lastInput = 0;
			PID_SPEED2.lastInput = 0;
			PID_POSITION3.lastInput = 0;
			PID_SPEED3.lastInput = 0;
			PID_POSITION4.lastInput = 0;
			PID_SPEED4.lastInput = 0;

			incWheel1Canal1EncoderCounter = 0;
			incWheel1Canal2EncoderCounter = 0;
			decWheel1Canal1EncoderCounter = 0;
			decWheel1Canal2EncoderCounter = 0;

			incWheel2Canal1EncoderCounter = 0;
			incWheel2Canal2EncoderCounter = 0;
			decWheel2Canal1EncoderCounter = 0;
			decWheel2Canal2EncoderCounter = 0;

			incWheel3Canal1EncoderCounter = 0;
			incWheel3Canal2EncoderCounter = 0;
			decWheel3Canal1EncoderCounter = 0;
			decWheel3Canal2EncoderCounter = 0;

			incWheel4Canal1EncoderCounter = 0;
			incWheel4Canal2EncoderCounter = 0;
			decWheel4Canal1EncoderCounter = 0;
			decWheel4Canal2EncoderCounter = 0;

			setState(&mainState, MAIN_PID);
		}
		break;
	case COMMAND_ROTATE:
		if (len == 4 && type == COMMAND_ROTATE) {
			/* send data to test send feature on Usb */
			//uint8_t dataToSend[10] = { 1, 8, 3, 4, 5, 6, 7, 8, 9, 10 };
			//TM_USB_VCP_Send(dataToSend, 10);
			/* get X Y distances */
			float radianToRotate = getRadianMoveFromBuffer(data);
			float move = getMoveFromRadian(radianToRotate);

			/*setPIDCoeficient(xMove, yMove);*/

			PID_POSITION1.mySetpoint = -move;
			PID_POSITION3.mySetpoint = move;
			PID_POSITION2.mySetpoint = -move;
			PID_POSITION4.mySetpoint = move;

			numberOfPositionEdges1 = 0;
			numberOfPositionEdges2 = 0;
			numberOfPositionEdges3 = 0;
			numberOfPositionEdges4 = 0;

			PID_POSITION1.ITerm = 0;
			PID_SPEED1.ITerm = 0;
			PID_POSITION2.ITerm = 0;
			PID_SPEED2.ITerm = 0;
			PID_POSITION3.ITerm = 0;
			PID_SPEED3.ITerm = 0;
			PID_POSITION4.ITerm = 0;
			PID_SPEED4.ITerm = 0;

			PID_POSITION1.lastInput = 0;
			PID_SPEED1.lastInput = 0;
			PID_POSITION2.lastInput = 0;
			PID_SPEED2.lastInput = 0;
			PID_POSITION3.lastInput = 0;
			PID_SPEED3.lastInput = 0;
			PID_POSITION4.lastInput = 0;
			PID_SPEED4.lastInput = 0;

			incWheel1Canal1EncoderCounter = 0;
			incWheel1Canal2EncoderCounter = 0;
			decWheel1Canal1EncoderCounter = 0;
			decWheel1Canal2EncoderCounter = 0;

			incWheel2Canal1EncoderCounter = 0;
			incWheel2Canal2EncoderCounter = 0;
			decWheel2Canal1EncoderCounter = 0;
			decWheel2Canal2EncoderCounter = 0;

			incWheel3Canal1EncoderCounter = 0;
			incWheel3Canal2EncoderCounter = 0;
			decWheel3Canal1EncoderCounter = 0;
			decWheel3Canal2EncoderCounter = 0;

			incWheel4Canal1EncoderCounter = 0;
			incWheel4Canal2EncoderCounter = 0;
			decWheel4Canal1EncoderCounter = 0;
			decWheel4Canal2EncoderCounter = 0;

			setState(&mainState, MAIN_PID);
		}
		break;
	case COMMAND_PENCIL_UP:
		moveUpPrehensor();
		break;
	case COMMAND_PENCIL_DOWN:
		moveDownPrehensor();
		break;
	case COMMAND_DECODE_MANCHESTER:
		setState(&mainState, MAIN_MANCH);
		break;
	case COMMAND_STOP_DECODE_MANCHESTER:
		setState(&mainState, MAIN_IDLE);
		break;
	}
}
